<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Malwarebytes Incident Response via the API.

You must provide a Client ID and Secret along with the Client Account to download.
	</string>
	<key>Identifier</key>
	<string>com.github.weswhet.download.malwarebytesnebula</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>malwarebytes</string>
		<key>CLIENT_ID</key>
		<string>%MWB_CLIENT_ID%</string>
		<key>CLIENT_SECRET</key>
		<string>%MWB_CLIENT_SECRET%</string>
		<key>ACCOUNT_ID</key>
		<string>%MWB_ACCOUNT_ID%</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MalwarebytesIncidentResponse</string>
			<key>Arguments</key>
			<dict>
				<key>client_id</key>
				<string>%CLIENT_ID%</string>
				<key>client_secret</key>
				<string>%CLIENT_SECRET%</string>
				<key>account_id</key>
				<string>%ACCOUNT_ID%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%download_url%</string>
				<key>filename</key>
				<string>Setup.MBEndpointAgent.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Malwarebytes Corporation (GVZRY6KDKR)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked_pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked_pkg/MBBRNebulaAgentInstaller.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/extracted_payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/extracted_payload/Library/Application Support/Malwarebytes/Malwarebytes Endpoint Agent/EndpointAgentDaemon.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpacked_pkg</string>
					<string>%RECIPE_CACHE_DIR%/extracted_payload</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
