<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads a Malwarebytes Nebula (Incident Response) pkg via Malwarebytes's API and imports it into a munki repo.

You must provide a Client ID and Secret along with the Client Account to download.

You must also specify an ACCOUNT TOKEN in order to enroll malwarebytes correctily.</string>
    <key>Identifier</key>
    <string>com.github.weswhet.munki.malwarebytesincidentresponse</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Security</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/malwarebytes</string>
        <key>ACCOUNT_TOKEN</key>
        <string>JrhGzFZs-3BaN-lMnX-YW3c-493141650896</string>
        <key>NAME</key>
        <string>malwarebytes</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>Protection against all varieties of threats, including ransomware, malware, zero-day exploits, adware, and viruses.</string>
            <key>developer</key>
            <string>Malwarebytes</string>
            <key>display_name</key>
            <string>Malwarebytes Incident Response</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>preinstall_script</key>
            <string>#!/bin/bash
# set the account token to activate

/bin/launchctl setenv ACCOUNTTOKEN %ACCOUNT_TOKEN%</string>
            <key>unattended_install</key>
            <true/>
            <key>uninstall_script</key>
            <string>#!/bin/sh

/Library/Application\ Support/Malwarebytes/Malwarebytes\ Endpoint\ Agent/EndpointAgentDaemon.app/Contents/MacOS/EndpointAgentDaemon -uninstall</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.weswhet.download.malwarebytesnebula</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/MBBRNebulaAgentInstaller.pkg/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array/>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Application Support/Malwarebytes/Malwarebytes Endpoint Agent/UserAgent.app</string>
                <key>requirement</key>
                <string>identifier "com.malwarebytes.UserAgent" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GVZRY6KDKR</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array/>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Application Support/Malwarebytes/Malwarebytes Endpoint Agent/EndpointAgentDaemon.app</string>
                <key>requirement</key>
                <string>identifier "com.malwarebytes.EndpointAgentDaemon" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GVZRY6KDKR</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/Application Support/Malwarebytes/Malwarebytes Endpoint Agent/EndpointAgentDaemon.app</string>
                    <string>/Library/Application Support/Malwarebytes/Malwarebytes Endpoint Agent/UserAgent.app</string>
                </array>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>additional_makepkginfo_options</key>
                <array>
                    <string>--pkgvers</string>
                    <string>%version%</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
