<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of Facebook Flipper. ARCH is either 'aarch64' or 'x64'.</string>
	<key>Identifier</key>
	<string>com.github.weswhet.download.flipper</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>facebook/flipper</string>
		<key>NAME</key>
		<string>flipper</string>
		<key>ARCH</key>
		<string>aarch64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>include_prereleases</key>
				<false/>
				<key>asset_regex</key>
				<string>Flipper-server-mac-%ARCH%.*</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>prefetch_filename</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
